In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [35]:
df = pd.read_csv("data/emails.csv")
df.head()

                                                text  spam
0  Subject: naturally irresistible your corporate...     1
1  Subject: the stock trading gunslinger  fanny i...     1
2  Subject: unbelievable new homes made easy  im ...     1
3  Subject: 4 color printing special  request add...     1
4  Subject: do not have money , get software cds ...     1

In [36]:
df1 = pd.read_csv("./data/spam_ham_dataset.csv")
df1.head()

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0

In [37]:
df1.drop(['Unnamed: 0','label'],axis=1,inplace=True)
df1

                                                   text  label_num
0     Subject: enron methanol ; meter # : 988291\r\n...          0
1     Subject: hpl nom for january 9 , 2001\r\n( see...          0
2     Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3     Subject: photoshop , windows , office . cheap ...          1
4     Subject: re : indian springs\r\nthis deal is t...          0
...                                                 ...        ...
5166  Subject: put the 10 on the ft\r\nthe transport...          0
5167  Subject: 3 / 4 / 2000 and following noms\r\nhp...          0
5168  Subject: calpine daily gas nomination\r\n>\r\n...          0
5169  Subject: industrial worksheets for august 2000...          0
5170  Subject: important online banking alert\r\ndea...          1

[5171 rows x 2 columns]

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5728 entries, 0 to 5727
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   text    5728 non-null   object
 1   spam    5728 non-null   int64
dtypes: int64(1), object(1)
memory usage: 89.6+ KB

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5171 entries, 0 to 5170
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   text       5171 non-null   object
 1   label_num  5171 non-null   int64
dtypes: int64(1), object(1)
memory usage: 80.9+ KB

In [40]:
df1.rename({"label_num":"spam"},axis=1,inplace=True)

In [41]:
sum(df.duplicated()),sum(df1.duplicated())

(33, 178)

In [42]:
df.shape,df1.shape

((5728, 2), (5171, 2))

In [47]:
df.drop_duplicates(inplace=True)
df1.drop_duplicates(inplace=True)

In [49]:
df.shape,df1.shape

((5695, 2), (4993, 2))

In [51]:
combine_df = pd.concat([df,df1])
# combine_df[duplicates].iloc[0].text
combine_df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
5165    False
5166    False
5167    False
5169    False
5170    False
Length: 10688, dtype: bool

In [30]:
df[df['text'] == 'Subject: research allocations to egm  hi becky ,  vince and i came up with these allocations for all of egm :  gary hickerson  rate & currency trading 10 . 0 %  agriculture trading  & origination 27 . 5 %  jeff shankman  weather 20 %  insurance 30 %  oil 7 . 5 %  coal 2 . 5 %  freight 2 . 5 %  total 100 %']

                                                   text  spam
1881  Subject: research allocations to egm  hi becky...     0
2155  Subject: research allocations to egm  hi becky...     0

In [32]:
sum(df.duplicated())

33

In [33]:
sum(df1.duplicated())

178